Revit 2024 API
RenderDuration Enumeration
 An enumerated type containing possible duration types to do Raytracer render.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public enum RenderDuration
Visual Basic
Public Enumeration RenderDuration
Visual C++
public enum class RenderDuration
Members
Member name | Description
ByLevel |  Render by the defined iterations.
ByTime |  Render by the defined time.
UntilSatisfactory |  Render until satisfactory.
See Also
Autodesk.Revit.DB Namespace